aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_common_gap.c
                 if( xErrCode != NRF_SUCCESS)
                 {
                     configPRINTF(( "Could not resume to connectable advertisement. \n" ));
                 }
            }

            if( xGattServerCb.pxConnectionCb )
            {
                xGattServerCb.pxConnectionCb( p_ble_evt->evt.gap_evt.conn_handle, ulGattServerIFhandle, false, &xConnectionRemoteAddress );
            }

            break;

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:

            if( p_ble_evt->evt.gatts_evt.params.authorize_request.type == BLE_GATTS_AUTHORIZE_TYPE_READ )
            {
                usLocalHandle = prvGattFromSDHandle( p_ble_evt->evt.gatts_evt.params.authorize_request.request.read.handle );

                if( ( usLocalHandle != UINT16_MAX ) && ( xGattServerCb.pxRequestReadCb != NULL ) )
                {
                    xGattServerCb.pxRequestReadCb( p_ble_evt->evt.gatts_evt.conn_handle,
                                                   BLE_GATTS_AUTHORIZE_TYPE_READ,
                                                   &xConnectionRemoteAddress,
                                                   usLocalHandle,
                                                   p_ble_evt->evt.gatts_evt.params.authorize_request.request.read.offset );
                }
            }
            else if( p_ble_evt->evt.gatts_evt.params.authorize_request.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE )
            {
                usLocalHandle = prvGattFromSDHandle( p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.handle );

                if( usLocalHandle != UINT16_MAX )
                {
                    bool IsNeedRsp = false;
                    bool IsPrep = false;
                    
                    /* TODO: Complete all cases */
                    switch( p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.op )
                    {
                        case BLE_GATTS_OP_WRITE_REQ:
                            IsNeedRsp = true;
                            break;

                        case BLE_GATTS_OP_WRITE_CMD:
                            break;

                        case BLE_GATTS_OP_SIGN_WRITE_CMD:
                            break;

                        case BLE_GATTS_OP_PREP_WRITE_REQ:
                            IsPrep = true;
                            break;

                        case BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL:
                            break;

                        case BLE_GATTS_OP_EXEC_WRITE_REQ_NOW:
                            break;

                        default:
                            xErrCode = NRF_ERROR_INVALID_STATE;
                            break;
                    }

                    if( ( xErrCode == NRF_SUCCESS ) && ( xGattServerCb.pxRequestWriteCb != NULL ) )
                    {
                        xGattServerCb.pxRequestWriteCb( p_ble_evt->evt.gatts_evt.conn_handle,
                                                        BLE_GATTS_AUTHORIZE_TYPE_WRITE,
                                                        &xConnectionRemoteAddress,
                                                        usLocalHandle,
                                                        p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.offset,
                                                        p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.len,
                                                        IsNeedRsp,
                                                        IsPrep,
                                                        (uint8_t *)p_ble_evt->evt.gatts_evt.params.authorize_request.request.write.data );
                    }
                }
            }
            else
            {
                configPRINTF(( "Error : BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST Invalid \n\r" ));
            }

            break;

        case BLE_GATTS_EVT_WRITE:

            usLocalHandle = prvGattFromSDHandle( p_ble_evt->evt.gatts_evt.params.write.handle );

            if( usLocalHandle != UINT16_MAX )
            {
                BTGattAttributeType_t eAttType = prvGattAttributeType( usLocalHandle );
                if( ( eAttType == GATT_CHAR ) || ( eAttType == GATT_DESCR ) )
                {
                    bool IsNeedRsp = false;
                    bool IsPrep = false;
                         
                    /* TODO: Complete all cases */
                    switch( p_ble_evt->evt.gatts_evt.params.write.op )
                    {
                        case BLE_GATTS_OP_WRITE_REQ:
                            IsNeedRsp = true;
                            break;

                        case BLE_GATTS_OP_WRITE_CMD:
                            break;

                        case BLE_GATTS_OP_SIGN_WRITE_CMD:
                            break;

                        case BLE_GATTS_OP_PREP_WRITE_REQ:
                            IsPrep = true;
                            break;

                        case BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL:
                            break;

                        case BLE_GATTS_OP_EXEC_WRITE_REQ_NOW:
                            break;

                        default:
                            xErrCode = NRF_ERROR_INVALID_STATE;
                            break;
                    }

                    if( ( xErrCode == NRF_SUCCESS ) && ( xGattServerCb.pxRequestWriteCb != NULL ) )
                    {
                        xGattServerCb.pxRequestWriteCb( p_ble_evt->evt.gatts_evt.conn_handle,
                                                        0,
                                                        &xConnectionRemoteAddress,
                                                        usLocalHandle,
                                                        p_ble_evt->evt.gatts_evt.params.write.offset,
                                                        p_ble_evt->evt.gatts_evt.params.write.len,
                                                        IsNeedRsp,
                                                        IsPrep,
                                                        (uint8_t *)p_ble_evt->evt.gatts_evt.params.write.data );
                    }                   
                }
            }

            break;

        case BLE_GATTS_EVT_HVC:

