aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_common_gap.c
BTStatus_t prvBTManagerInit( const BTCallbacks_t * pxCallbacks )
{
    BTStatus_t xStatus = eBTStatusSuccess;

    memset( &xProperties, 0, sizeof( xProperties ) );
    xProperties.xDeviceType = eBTdeviceDevtypeBle;
    /* Set the device name from the aws_ble_config.h. We store it without a trailing zero. */
    xProperties.usDeviceNameLength = sizeof( bleconfigDEVICE_NAME ) - 1;
    xProperties.puDeviceName = ( uint8_t * ) pvPortMalloc( xProperties.usDeviceNameLength );
    xProperties.ulMtu = NRF_SDH_BLE_GATT_MAX_MTU_SIZE;
    xProperties.bOnlySecure = true;
    xProperties.bBondable = true;

    if( xProperties.puDeviceName != NULL )
    {
        memcpy( xProperties.puDeviceName, bleconfigDEVICE_NAME, xProperties.usDeviceNameLength );
    }
    else
    {
        xStatus = eBTStatusNoMem;
    }

    if( pxCallbacks != NULL )
    {
        xBTCallbacks = *pxCallbacks;
    }
    else
    {
        xStatus = eBTStatusFail;
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBtManagerCleanup()
{
    BTStatus_t xStatus = eBTStatusSuccess;

    vPortFree( xProperties.puDeviceName );

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTEnable( uint8_t ucGuestMode )
{
    BTStatus_t xStatus = eBTStatusSuccess;
    uint32_t xNRFstatus = 0;

    xNRFstatus = nrf_sdh_enable_request();

    if( xNRFstatus != NRF_SUCCESS )
    {
        xStatus = eBTStatusFail;
    }

    /** If status is ok and callback is set, trigger the callback.
     *  If status is fail, not need to trig a callback as original call failed.
     **/
    if( ( xStatus == eBTStatusSuccess ) && ( xBTCallbacks.pxDeviceStateChangedCb != NULL ) )
    {
        xBTCallbacks.pxDeviceStateChangedCb( eBTstateOn );
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTDisable()
{
    BTStatus_t xStatus = eBTStatusSuccess;

    uint32_t err_code = 0;

    err_code = nrf_sdh_disable_request();

    if( err_code != NRF_SUCCESS )
    {
        xStatus = eBTStatusFail;
    }

    /** If status is ok and callback is set, trigger the callback.
     *  If status is fail, not need to trig a callback as original call failed.
     **/
    if( ( xStatus == eBTStatusSuccess ) && ( xBTCallbacks.pxDeviceStateChangedCb != NULL ) )
    {
        xBTCallbacks.pxDeviceStateChangedCb( eBTstateOff );
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGetAllDeviceProperties()
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGetDeviceProperty( BTPropertyType_t xType )
{
    BTStatus_t xStatus = eBTStatusSuccess;
    BTProperty_t xReturnedProperty;

    ret_code_t xNRFstatus = NRF_SUCCESS;

    if( xBTCallbacks.pxAdapterPropertiesCb != NULL )
    {
        xReturnedProperty.xType = xType;

        switch( xType )
        {
            case eBTpropertyBdname:
                xReturnedProperty.pvVal = xProperties.puDeviceName;
                xReturnedProperty.xLen = xProperties.usDeviceNameLength;
                xBTCallbacks.pxAdapterPropertiesCb( eBTStatusSuccess, 1, &xReturnedProperty );
                break;

            case eBTpropertyBdaddr:
                /* TODO: find out where shoud we store all the information provided to user */
                /* and who is responsible to free the memory */
                xNRFstatus = sd_ble_gap_addr_get( &xProperties.xDeviceAddress );

                if( xNRFstatus == NRF_SUCCESS )
                {
                    memcpy( ( ( BTBdaddr_t * ) xReturnedProperty.pvVal )->ucAddress, xProperties.xDeviceAddress.addr, BLE_GAP_ADDR_LEN );
                    xReturnedProperty.xLen = BLE_GAP_ADDR_LEN;
                }
                else
                {
                    xStatus = eBTStatusFail;
                }

                xBTCallbacks.pxAdapterPropertiesCb( eBTStatusSuccess, 1, &xReturnedProperty );
                break;

            case eBTpropertyTypeOfDevice:
                xReturnedProperty.pvVal = &xProperties.xDeviceType;
                xReturnedProperty.xLen = sizeof( xProperties.xDeviceType );
                xBTCallbacks.pxAdapterPropertiesCb( eBTStatusSuccess, 1, &xReturnedProperty );
                break;

            case eBTpropertyLocalMTUSize:
                xReturnedProperty.pvVal = &xProperties.ulMtu;
                xReturnedProperty.xLen = sizeof( xProperties.ulMtu );
                xBTCallbacks.pxAdapterPropertiesCb( eBTStatusSuccess, 1, &xReturnedProperty );
                break;

            case eBTpropertyBondable:
                xReturnedProperty.pvVal = &xProperties.bBondable;
                xReturnedProperty.xLen = sizeof( bool );
                xBTCallbacks.pxAdapterPropertiesCb( eBTStatusSuccess, 1, &xReturnedProperty );
                break;

            case eBTpropertyIO:

                switch( xSecurityParameters.io_caps )
                {
                    case BLE_GAP_IO_CAPS_DISPLAY_ONLY:
                        xProperties.xIOTypes = eBTIODisplayOnly;
                        break;

                    case BLE_GAP_IO_CAPS_DISPLAY_YESNO:
                        xProperties.xIOTypes = eBTIODisplayYesNo;
                        break;

                    case BLE_GAP_IO_CAPS_KEYBOARD_ONLY:
                        xProperties.xIOTypes = eBTIOKeyboardOnly;
                        break;

                    case BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY:
                        xProperties.xIOTypes = eBTIOKeyboardDisplay;
                        break;

                    default:
                        xProperties.xIOTypes = eBTIONone;
                        break;
                }

                xReturnedProperty.pvVal = &xProperties.xIOTypes;
                xReturnedProperty.xLen = sizeof( xProperties.xIOTypes );
                xBTCallbacks.pxAdapterPropertiesCb( eBTStatusSuccess, 1, &xReturnedProperty );
                break;

            case eBTpropertyAdapterBondedDevices:
               {
                   int peer_count = 0;
                   pm_peer_data_bonding_t bonding_data;
                   ret_code_t xErrCode = NRF_SUCCESS;
                   pm_peer_id_t current_peer_id = pm_next_peer_id_get( PM_PEER_ID_INVALID );

                   while( current_peer_id != PM_PEER_ID_INVALID )
                   {
                       xErrCode = pm_peer_data_bonding_load( current_peer_id, &bonding_data );
                       /* TODO: Resolve real addresses */
                       memcpy(&(pucBondedAddresses[peer_count * btADDRESS_LEN]), bonding_data.peer_ble_id.id_addr_info.addr, btADDRESS_LEN); 
                       peer_count += 1;

                       if( peer_count >= bleconfigMAX_BONDED_DEVICES )
                       {
                           break;
                       }

