aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_common_gap.c
                       current_peer_id = pm_next_peer_id_get( current_peer_id );
                   }

                   xReturnedProperty.pvVal = pucBondedAddresses;
                   xReturnedProperty.xLen = peer_count;
                   xBTCallbacks.pxAdapterPropertiesCb( eBTStatusSuccess, 1, &xReturnedProperty );
               }

               break;

            case eBTpropertySecureConnectionOnly:
                xReturnedProperty.pvVal = &xProperties.bOnlySecure;
                xReturnedProperty.xLen = 1;
                xBTCallbacks.pxAdapterPropertiesCb( eBTStatusSuccess, 1, &xReturnedProperty );

            default:
                xStatus = eBTStatusUnsupported;
                xBTCallbacks.pxAdapterPropertiesCb( eBTStatusFail, 0, NULL );
        }
    }

    return xStatus;
}

/*-----------------------------------------------------------*/

static void prvBTSetSecurityReq(security_req_t xLevel, ble_gap_conn_sec_mode_t * pxPerm, bool bLesc)
{


    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(pxPerm);
    switch (xLevel)
    {
        case SEC_NO_ACCESS:
            BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(pxPerm);
        break;
        case SEC_OPEN:
            BLE_GAP_CONN_SEC_MODE_SET_OPEN(pxPerm);
        break;
        case SEC_JUST_WORKS:
            BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(pxPerm);
        break;
        case SEC_MITM:
            if ( bLesc )
            {
                BLE_GAP_CONN_SEC_MODE_SET_LESC_ENC_WITH_MITM(pxPerm);
            }
            else
            {
                BLE_GAP_CONN_SEC_MODE_SET_ENC_WITH_MITM(pxPerm);
            }
        break;
        case SEC_SIGNED:
            BLE_GAP_CONN_SEC_MODE_SET_SIGNED_NO_MITM(pxPerm);
        break;
        case SEC_SIGNED_MITM:
            BLE_GAP_CONN_SEC_MODE_SET_SIGNED_WITH_MITM(pxPerm);
        break;
    }
    return;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTSetDeviceProperty( const BTProperty_t * pxProperty )
{
    BTStatus_t xStatus = eBTStatusSuccess;
    ret_code_t xNRFstatus = NRF_SUCCESS;
    nrf_ble_gatt_t * xGattHandler = prvGetGattHandle();

    switch( pxProperty->xType )
    {
        case eBTpropertyBdname:

            xProperties.usDeviceNameLength = pxProperty->xLen;
            vPortFree( xProperties.puDeviceName );
            xProperties.puDeviceName = ( uint8_t * ) pvPortMalloc( xProperties.usDeviceNameLength );

            if( xProperties.puDeviceName != NULL )
            {
                memcpy( xProperties.puDeviceName, ( pxProperty->pvVal ), xProperties.usDeviceNameLength );

                ble_gap_conn_sec_mode_t xSecurityMode;
                security_req_t xLevel = SEC_NO_ACCESS;
                bool bLesc;
               
                #if ( bleconfigREQUIRE_SIGNED && bleConfigENCRYPTION_REQUIRED ) 
                /* Mode 2 */
                    #if bleconfigREQUIRE_MITM
                        xLevel = SEC_SIGNED_MITM; /* Level 2 */
                    #else
                        xLevel = SEC_SIGNED; /* Level 1 */
                    #endif
                #else
                /* Mode 1 */
                    #if ( bleconfigREQUIRE_MITM && bleconfigENABLE_SECURE_CONNECTION ) /* Level 4 */
                        xLevel = SEC_MITM;
                        bLesc = true;
                    #elif bleconfigREQUIRE_MITM  /* Level 3 */
                        xLevel = SEC_MITM;
                        bLesc = false;
                    #elif ( bleConfigENCRYPTION_REQUIRED && ( !bleconfigREQUIRE_MITM ) )  /* Level 2 */
                        xLevel = SEC_JUST_WORKS;
                    #else
                        xLevel = SEC_OPEN;  /* Level 1 */
                    #endif
                #endif

                prvBTSetSecurityReq( xLevel, &xSecurityMode, bLesc );
                xNRFstatus = sd_ble_gap_device_name_set( &xSecurityMode, xProperties.puDeviceName, xProperties.usDeviceNameLength );

                if( xNRFstatus != NRF_SUCCESS )
                {
                    xStatus = eBTStatusFail;
                }
            }
            else
            {
                xStatus = eBTStatusNoMem;
            }

            if( ( xBTCallbacks.pxAdapterPropertiesCb != NULL ) && ( xStatus == eBTStatusSuccess ) )
            {
                xBTCallbacks.pxAdapterPropertiesCb( xStatus, 1, ( BTProperty_t * ) pxProperty );
            }

            break;

        case eBTpropertyBdaddr:

            xStatus = eBTStatusUnsupported;
            break;

        case eBTpropertyTypeOfDevice:

            xStatus = eBTStatusUnsupported;
            break;

        case eBTpropertyLocalMTUSize: /* TODO: Check if we should save gatt handler from connection even and update its MTU */
            xProperties.ulMtu = *( ( uint32_t * ) pxProperty->pvVal );

            if( bGattInitialized )
            {
                xNRFstatus = nrf_ble_gatt_att_mtu_periph_set( xGattHandler, xProperties.ulMtu );

                if( ( xNRFstatus == NRF_SUCCESS ) && bIsConnected )
                {
                    xNRFstatus = xBTGattUpdateMtu( xGattHandler, usGattConnHandle );
                }
            }

            xStatus = BTNRFError( xNRFstatus );

            if( ( xBTCallbacks.pxAdapterPropertiesCb != NULL ) && ( xStatus == eBTStatusSuccess ) )
            {
                xBTCallbacks.pxAdapterPropertiesCb( xStatus, 1, ( BTProperty_t * ) pxProperty );
            }

            break;

        case eBTpropertyBondable:
            xProperties.bBondable = *( ( bool * ) pxProperty->pvVal );

            if( xProperties.bBondable == true )
            {
                xSecurityParameters.bond = true;
                xSecurityParameters.kdist_own.enc = 1;
                xSecurityParameters.kdist_own.id = 1;
                xSecurityParameters.kdist_peer.enc = 1;
                xSecurityParameters.kdist_peer.id = 1;
            }
            else
            {
                xSecurityParameters.bond = false;
                xSecurityParameters.kdist_own.enc = 0;
                xSecurityParameters.kdist_own.id = 0;
                xSecurityParameters.kdist_peer.enc = 0;
                xSecurityParameters.kdist_peer.id = 0;
            }

            xNRFstatus = pm_sec_params_set( &xSecurityParameters );

