aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_common_gap.c
        case eBTsspVariantPasskeyEntry: 
            xStatus = eBTStatusUnsupported;
            break;

        case eBTsspVariantPasskeyNotification:
            xStatus = eBTStatusUnsupported;
            break;

        default:
            break;
    }

	if( xErrCode != NRF_SUCCESS)
	{
	    BT_NRF_PRINT_ERROR( pm_conn_secure, xErrCode );
	}

    if(xErrCode != NRF_SUCCESS)
    {
        xStatus = eBTStatusFail;
    }
/*    ret_code_t xErrCode = pm_conn_secure(usGattConnHandle, false); */

    return xStatus;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTReadEnergyInfo()
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTDutModeConfigure( bool bEnable )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTDutModeSend( uint16_t usOpcode,
                             uint8_t * pucBuf,
                             size_t xLen )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTLeTestMode( uint16_t usOpcode,
                            uint8_t * pucBuf,
                            size_t xLen )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTConfigHCISnoopLog( bool bEnable )
{
    return eBTStatusUnsupported;
}


/*-----------------------------------------------------------*/

BTStatus_t prvBTConfigClear()
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTReadRssi( const BTBdaddr_t * pxBdAddr )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

BTStatus_t prvBTGetTxpower( const BTBdaddr_t * pxBdAddr,
                            BTTransport_t xTransport )
{
    return eBTStatusUnsupported;
}

/*-----------------------------------------------------------*/

const void * prvGetClassicAdapter()
{
    return NULL;
}

/*-----------------------------------------------------------*/

const BTInterface_t * BTGetBluetoothInterface()
{
    return &xBTinterface;
}

void prvPmEventHandler( const pm_evt_t * event )
{
    pm_handler_on_pm_evt( event );
    pm_handler_flash_clean( event );
    pm_conn_sec_config_t conn_sec_config;

    ret_code_t err_code;
/*    configPRINTF(((  0, "PM_EVT: %d\n", event->evt_id ); */

    switch( event->evt_id )
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
            if( xBTCallbacks.pxBondedCb )
            {
                xBTCallbacks.pxBondedCb( eBTStatusSuccess,
                                         &xConnectionRemoteAddress,
                                         true );
            }

            break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
           /* Repairing attempt between already bonded devices */
           {
               conn_sec_config.allow_repairing = true;
               pm_conn_sec_config_reply( event->conn_handle, &conn_sec_config );
           }
           break;

        case PM_EVT_CONN_SEC_START:
/* Consider to rework in case of AWS_BLE API further changes for different security connection establishing variants: */
/*            configPRINTF((( "PM_EVT_CONN_SEC_START\n" ); */
/* 2. eBTsspVariantPasskeyEntry for MITM with Display+Yes/No or Display/Keyboard IOCaps */
/* 3. eBTsspVariantPasskeyNotification for MITM with Display+Yes/No or Display/Keyboard IOCaps */
/* 4. eBTsspVariantConsent in case of NO MITM (Just Works) without IOCaps (eBTIONone) */
/*          configPRINTF( "PM_EVT_CONN_SEC_START\n" ); */
            {
                BTSspVariant_t xPairingVariant = eBTsspVariantConsent;
/* This is an informational event; no action is needed for the procedure to proceed. */
/* So, just responce with consent */
                switch( event->params.conn_sec_start.procedure )
                {
                    case PM_CONN_SEC_PROCEDURE_ENCRYPTION:
                        xPairingVariant = eBTsspVariantConsent;
                        break;

                    PM_CONN_SEC_PROCEDURE_BONDING:
                        xPairingVariant = eBTsspVariantConsent;
                        break;

                    PM_CONN_SEC_PROCEDURE_PAIRING:
                        xPairingVariant = eBTsspVariantConsent;
                        break;
                }

                if( xBTCallbacks.pxSspRequestCb )
                {
                    xBTCallbacks.pxSspRequestCb( &xConnectionRemoteAddress,
                                                 NULL,
                                                 0,
                                                 xPairingVariant,
                                                 0 );
                }
            }
            break;

        case PM_EVT_CONN_SEC_PARAMS_REQ:

            if( xProperties.bOnlySecure )
            {
                if( event->params.conn_sec_params_req.p_peer_params &&
                    ( event->params.conn_sec_params_req.p_peer_params->mitm == 0 ) ) /* The peer tries to connect in "Just Works" mode */
                {
                    sd_ble_gap_sec_params_reply( event->conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL );

                    if( xBTCallbacks.pxPairingStateChangedCb )
                    {
                        xBTCallbacks.pxPairingStateChangedCb( eBTStatusFail,
                                                              &xConnectionRemoteAddress,
                                                              eBTbondStateNone,
                                                              eBTSecLevelNoSecurity,
                                                              eBTauthFailInsuffSecurity );
                    }
                }
            }
/* Consider to rework in case of AWS_BLE API further changes for different security connection establishing variants: */
/* 1. eBTsspVariantPasskeyConfirmation for MITM with Display+Yes/No or Display/Keyboard IOCaps */
/* 2. eBTsspVariantPasskeyEntry for MITM with Display+Yes/No or Display/Keyboard IOCaps */
/* 3. eBTsspVariantPasskeyNotification for MITM with Display+Yes/No or Display/Keyboard IOCaps */
/* 4. eBTsspVariantConsent in case of NO MITM (Just Works) without IOCaps (eBTIONone) */
/*            if (xBTCallbacks.pxSspRequestCb) { */
/*                xBTCallbacks.pxSspRequestCb(NULL, */
/*                                            NULL, */
/*                                            0, */
/*                                            eBTsspVariantConsent, */
/*                                            0); */
/*            } */
            break;

        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:

/* This is an event to inform user application when data was changed after successed write command/request */
/*            if( xBTCallbacks.pxBondedCb ) */
/*            { */
/*                if( event->params.peer_data_update_succeeded.data_id == PM_PEER_DATA_ID_BONDING ) */
/*                {
/* NOTE: Responce does not depend on condition */
/*                    if( event->params.peer_data_update_succeeded.action == PM_PEER_DATA_OP_UPDATE ) */
/*                    { */
/*                        xBTCallbacks.pxBondedCb( eBTStatusSuccess, */
/*                                                 &xConnectionRemoteAddress, */
/*                                                 true ); */
/*                    } */
/*                    else */
/*                    { */
/*                        xBTCallbacks.pxBondedCb( eBTStatusSuccess, */
/*                                                 &xConnectionRemoteAddress, */
/*                                                 true ); */
/*                    } */
/*                } */
/*            } */
            break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
/*            configPRINTF((( "PM_EVT_CONN_SEC_SUCCEEDED\n" ); */
            break;

        case PM_EVT_CONN_SEC_FAILED:
/*            configPRINTF((( "PM_EVT_CONN_SEC_FAILED\n" ); */
            configPRINTF(( "Failed to secure connection. Disconnecting." ));
            {
                uint8_t error_src = event->params.conn_sec_failed.error_src;
                uint16_t error_code = event->params.conn_sec_failed.error;
                uint16_t process = event->params.conn_sec_failed.procedure;
                uint8_t hci_status_code = BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION;

                NRF_LOG_DEBUG( 0, "PM_EVT_CONN_SEC_FAILED src: 0x%x; err: 0x%x; proc: 0x%x\n\r", 
                                  error_src,
                                  error_code,
                                  process );
                
                
