aws/amazon-freertos/lib/bluetooth_low_energy/portable/nordic/nrf52840-dk/aws_ble_hal_common_gap.c
                if ( error_code == PM_CONN_SEC_ERROR_PIN_OR_KEY_MISSING )
                {
                    hci_status_code = BLE_HCI_STATUS_CODE_PIN_OR_KEY_MISSING;
                }
                
                err_code = sd_ble_gap_disconnect( event->conn_handle, hci_status_code );

                if( err_code != NRF_ERROR_INVALID_STATE )
                {
                    APP_ERROR_CHECK( err_code );
                }
            }

            usGattConnHandle = BLE_CONN_HANDLE_INVALID;
            break;

        case PM_EVT_STORAGE_FULL:
            /* Run garbage collection on the flash. */
            err_code = fds_gc();

            if( err_code == FDS_ERR_NO_SPACE_IN_QUEUES )
            {
                /* Retry. */
            }
            else
            {
                APP_ERROR_CHECK( err_code );
            }

            break;

        case PM_EVT_PEER_DELETE_SUCCEEDED:
            break;

        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
            break;

        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
        /* This can happen when the local DB has changed. */
            break;

        case PM_EVT_SERVICE_CHANGED_IND_SENT:
            break;

        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
            break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
            /* Assert. */
            APP_ERROR_CHECK( event->params.peer_data_update_failed.error );
            break;

        case PM_EVT_PEER_DELETE_FAILED:
            /* Assert. */
            APP_ERROR_CHECK( event->params.peer_delete_failed.error );
            break;

        case PM_EVT_PEERS_DELETE_FAILED:
            /* Assert. */
            APP_ERROR_CHECK( event->params.peers_delete_failed_evt.error );
            break;

        case PM_EVT_ERROR_UNEXPECTED:
            /* Assert. */
            APP_ERROR_CHECK( event->params.error_unexpected.error );
            break;

        default:
            configPRINTF(("PM_UNKNOWN, %d\n ", event->evt_id ));
            break;
    }
}
